<script setup>
import { ref, onMounted } from 'vue'
import VMdPreview from "@kangc/v-md-editor/lib/preview";
import HeaderForAll from "@/components/Modules/HeaderForAll.vue";

let text = ref('# 南科大活动中心用户手册\n' +
    '\n' +
    '## 学生手册\n' +
    '\n' +
    '南科大活动中心是一个为南科大学生提供活动信息发布、活动报名、活动信息交流等服务的平台，学生可以通过该平台方便快捷地了解到校园内各种活动的信息，线上对感兴趣的活动进行报名，与活动的举办方以及有相同爱好的其他参与者进行沟通交流。以下是南科大活动中心的学生使用手册，希望能够让你更好地了解和使用南科大活动中心平台服务。\n' +
    '\n' +
    '  \n' +
    '### 我要如何注册与登录账号？\n' +
    '\n' +
    '如果你是南科大的学生，你拥有统一注册的南科大学生账号，你可以使用南科大学生账号登录南科大活动中心平台。\n' +
    '[点击这里](http://10.16.88.247:8083) 登录南科大活动中心平台。\n' +
    '\n' +
    '如果你是校外人士，也想参与到南科大丰富多彩的活动中来，你可以通过注册一个南科大活动中心账号来登录平台。\n' +
    '[点击这里](http://10.16.88.247:8083/signup) 注册一个南科大活动中心账号。\n' +
    '\n' +
    '\n' +
    '### 我要如何修改个人信息？\n' +
    '\n' +
    '请点击右上角的头像，在页面中你可以自由地修改你的用户名等个人信息，也可以上传你喜欢的头像。\n' +
    '[点击这里](http://10.16.88.247:8083/profile) 修改个人信息。\n' +
    '\n' +
    '\n' +
    '### 我要如何寻找到我感兴趣的活动？\n' +
    '\n' +
    '本平台提供了多种方式供你寻找到你感兴趣的活动。\n' +
    '\n' +
    '1. 在登录后的主界面，我们会为你推荐一些热门活动，你可以直接点击查看。\n' +
    '\n' +
    '2. 在导航栏中，你可以点击“所有活动”查看所有活动，你也可以在主界面的搜索框中输入关键字搜索你感兴趣的活动。\n' +
    '\n' +
    '3. 每个活动都有自己的详细信息页面，你可以在这个页面查看活动的详细信息，也可以在此页面对活动进行收藏、报名、评论等操作。\n' +
    '\n' +
    '4. 多与活动的主办方以及其他的参与者进行交流！你可以多参考他人的意见，也可以分享你的看法；为主办方提供宝贵的建议，促进校内活动越办越好，也可以结交到更多志同道合的朋友。详情见下条。\n' +
    '\n' +
    '\n' +
    '### 我有哪些方式可以与他人交流？\n' +
    '\n' +
    '本平台为大家提供了多种便捷的交流方式。\n' +
    '\n' +
    '1. 在活动的详细信息页面以及他人发布的帖子下方都有评论区，你可以在这里留下你的看法，与他人交流。本平台使用类似Bilibili网站的评论二级树结构，你可以对活动进行评论，也可以回复他人的评论。被回复者会在消息中心收到通知，可以快捷跳转到对应的活动或帖子页面。\n' +
    '\n' +
    '2. 包括主办方在内的所有用户都可以进行私信交流。你可以点击对方头像悬浮框中的聊天按钮，进入私信页面，与对方进行一对一的交流。收到新消息时，你会在消息中心收到通知。\n' +
    '\n' +
    '3. 用户可以发布帖子，分享自己的活动、心情、感悟等。你可以在帖子下方进行评论，也可以对帖子进行点赞。当然，你也可以发布自己的帖子，与他人分享你的亲身经历。详情见下文帖子模块的使用介绍。\n' +
    '\n' +
    '\n' +
    '[点击这里](http://10.16.88.247:8083/message) 查看消息中心。\n' +
    '\n' +
    '\n' +
    '### 我要如何报名参加活动？\n' +
    '\n' +
    '当你发现感兴趣的活动时，你可以点击收藏按钮将活动收藏。当你决定参加活动时，你可以点击报名按钮报名参加活动。本平台有两种报名形式：\n' +
    '1. 计数式报名：活动主办方设置了报名人数上限，你可以直接点击报名按钮报名参加活动。当报名人数达到上限时，你将无法再报名参加活动。\n' +
    '2. 自定义表格报名：活动主办方设置了自定义表格，你需要填写表格中的信息后才能报名参加活动。\n' +
    '\n' +
    '你可以在导航栏的“我的活动”中查看你收藏的活动和报名的活动。 [点击这里](http://http://10.16.88.247:8083/event/my) 查看自己的活动。\n' +
    '\n' +
    '\n' +
    '### 这里写post相关的东西？\n' +
    '\n' +
    '\n' +
    '\n' +
    '\n' +
    '### 我也想举办活动，我要如何发布活动？\n' +
    '\n' +
    '发布活动需要有特殊的账号权限，如果你想发布活动，请联系管理员为你开通发布活动的权限。并阅读下文的举办方手册。\n' +
    '\n' +
    '\n' +
    '\n' +
    '\n' +
    '\n' +
    '## 举办方手册\n' +
    '\n' +
    '本平台为各位举办方提供了方便快捷的活动发布、沟通、管理等服务，希望能够帮助各位以更加方便的方式对活动进行宣传与组织。以下是南科大活动中心的举办方使用手册，希望能够让各位更好地了解和使用南科大活动中心平台活动的发布与管理流程。\n' +
    '\n' +
    '### 我要如何发布活动？\n' +
    '\n' +
    '发布活动需要有特殊的账号权限，如果你想发布活动却没有发布活动的权限，请联系管理员为你开通发布活动的权限。\n' +
    '\n' +
    '如果你的账号已经被管理员开通了发布活动的权限，你可以在导航栏中点击“活动管理”，并在该页面点击“发布活动”按钮进入发布活动页面。\n' +
    '[点击这里](http://10.16.88.247:8083/event/create) 发布活动。\n' +
    '\n' +
    '发布页面中需要你填写若干的活动信息，包括该活动的推送标题，活动名称，活动的报名时间和举办时间，上传活动海报，填写活动简介等。其中有两项需要特别介绍：\n' +
    '+ 报名方式：\n' +
    '    + 若选择“计数式报名”，则需要填写报名人数上限。如果不填写，则默认为不限制报名人数。\n' +
    '    + 若选择“自定义表格报名”，则需要填写自定义表格的信息。自定义表格的信息包括每个表项的名称、表项类型（文本框、选择框）、是否为必填项等。你可以自由地对表项进行增删，对于选择框类型的表项，你可以自由地添加与删除选项。\n' +
    '+ 活动详情：\n' +
    '    + 你可以在活动详情中使用Markdown语法进行排版，包括标题、列表、图片、链接等。当然， Markdown也支持HTML语法，你可以在活动详情中使用HTML语法进行排版。你可以在 [这里](https://www.markdownguide.org/basic-syntax/) 查看Markdown语法的基本使用方法。\n' +
    '\n' +
    '\n' +
    '### 发布活动后，我要如何查看活动的报名情况？\n' +
    '\n' +
    '在导航栏的“活动管理”中，你可以查看你发布的所有活动。点击每项活动对应的“导出报名表格”按钮，你可以下载该活动的报名信息。报名信息以Excel表格的形式下载，包括报名人的用户名、报名时间、报名信息等。\n' +
    '[点击这里](http://10.16.88.247:8083/event/manage) 查看活动管理页面。\n' +
    '\n' +
    '\n' +
    '\n' +
    '## 管理员手册\n' +
    '\n')

</script>

<template>
  <div>
    <HeaderForAll></HeaderForAll>
  </div>
  <v-md-preview :text="text"></v-md-preview>

</template>

<style scoped>

</style>